content/posts/books.md
+++
title = "Books"
author = ["OPSXCQ"]
date = 2020-01-01
draft = false
+++

Bellow a curated list of books which I consumed in the recent past years, which
my thoughts on them.


## Machine Learning and Data Science books {#machine-learning-and-data-science-books}


### TensorFlow for deep learning : from linear regression to reinforcement learning (<&BharathRamsundar600>) {#tensorflow-for-deep-learning-from-linear-regression-to-reinforcement-learning--and-bharathramsundar600}

Overall is a subpar _hello world_ kind of book for `Tensorflow`, nothing but the
basics. Chapter 8 on _Reinforcement Learning_ has some nice examples which are
easy to be understood.


### Hands-On Neural Networks with TensorFlow 2.0: Understand TensorFlow, from static graph to eager execution, and design neural networks (<&PaoloGaleone674>) {#hands-on-neural-networks-with-tensorflow-2-dot-0-understand-tensorflow-from-static-graph-to-eager-execution-and-design-neural-networks--and-paologaleone674}

Is a book from _Packt_ but besides the bad reputation from this publisher, the
books is quite good, it touches some more practical subjects, as how to convert
a model to `Tensorflow.js` and some practical examples of using _Generative
Adversarial Networks_. Besides other _Packt_ books where chapters usually don't
maintain a context or narrative in between them, this book focus solely on image
related problems.